# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
# Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.
a = abs(int(input('введите длину пробежки в первый день тренировки, км.: ')))
b = abs(int(input('введите длину пробежки в последний день тренировки, км.: ')))

day_number = 1
while a <= b:
    a = a*1.1
    day_number +=1
print("Для такой тренировки потребуется ", day_number, "дн.")